Tekla Open API Reference for Tekla Structures 2025
ViewMarkBasicSymbolAttributes Properties
The ViewMarkBasicSymbolAttributes type exposes the following members.
Properties
Name | Description
Shape
 The shape of the mark symbol.
Size
 The size of the mark symbol.
Top
See Also
Reference
ViewMarkBasicSymbolAttributes Class
Tekla.Structures.Drawing Namespace